---
kind: method
id: M:Autodesk.Revit.DB.FilterableValueProvider.Dispose
source: html/5c454c40-9624-28b2-6e9a-1cf4e03b94d6.htm
---
# Autodesk.Revit.DB.FilterableValueProvider.Dispose Method

Releases all resources used by the FilterableValueProvider

## Syntax (C#)
```csharp
public void Dispose()
```